tut/17/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


pointSync false;


patches
(
    {    
        name AMIone;

        patchInfo
        {
            type cyclicAMI;
            neighbourPatch AMItwo;
           
            transform none;
        }

        constructFrom patches;

        patches (AMI1);
  
    }
    {
       
        name AMItwo;

        
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch AMIone;

   
            transform none;
            
        }

       
        constructFrom patches;

       
        patches (AMI2);

        
    }
);

// ************************************************************************* //
