tut/17/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem patchLocal;

//globalCoeffs
//{
//    e1              (1 0 0);
//    e2              (0 1 0);
//}

patchLocalCoeffs
{
    e1              (1 0 0);
    e2              (0 1 0);
}

directions // comment out as required
(
    e1
    e2
);

patchLocalCoeffs
{
    patch           frontAndBackPlanes;
}

useHexTopology  yes;

geometricCut    yes;

writeMesh       no;

// ************************************************************************* //
